tap "homebrew/bundle"
tap "homebrew/core"

brew "starship"
brew "vim"
brew "tmux"

brew "coreutils"
brew "diffutils"
brew "gawk"
brew "grep"
brew "gnu-sed"
brew "gnu-tar"
brew "gzip"

brew "git"
brew "gh"
brew "ghq"
brew "git-secrets"

brew "jq"
brew "peco"
brew "wget"
brew "curl"
brew "httpie"
brew "ipcalc"

brew "tfenv"
brew "terraformer"

brew "mysql"

brew "go@1.19"

brew "pyenv"

brew "ruby-build"
brew "rbenv"

brew "nodenv"

brew "awscli@2"

brew "kubernetes-cli"
brew "kubectx"
brew "helm"
brew "helmfile"

tap "homebrew/cask-fonts"
cask "font-hackgen"
cask "font-hackgen-nerd"

tap "homebrew/cask-drivers"
cask "elgato-control-center"
cask "shureplus-motiv"

tap "k1low/tap"
brew "k1low/tap/tbls"

cask "alfred"
cask "scroll-reverser"
cask "google-chrome"
cask "google-japanese-ime"
cask "discord"
cask "wezterm"
cask "visual-studio-code"
cask "notion"
cask "dropbox"
cask "deepl"
cask "bitwarden"
cask "spotify"
cask "docker"
