tap "homebrew/bundle"
tap "homebrew/core"

brew "aqua"

brew "coreutils"
brew "diffutils"
brew "gawk"
brew "grep"
brew "gnu-sed"
brew "gnu-tar"
brew "gzip"
brew "vim"
brew "tmux"
brew "git"
brew "wget"
brew "curl"
brew "mysql"
brew "ruby-build"

tap "homebrew/cask-fonts"
cask "font-hackgen"
cask "font-hackgen-nerd"

tap "homebrew/cask-drivers"
cask "elgato-control-center"
cask "shureplus-motiv"

tap "k1low/tap"
brew "k1low/tap/tbls"

cask "alfred"
cask "scroll-reverser"
cask "google-chrome"
cask "google-japanese-ime"
cask "karabiner-elements"
cask "discord"
cask "wezterm"
cask "visual-studio-code"
cask "notion"
cask "dropbox"
cask "deepl"
cask "bitwarden"
cask "spotify"
cask "docker"
cask "microsoft-remote-desktop"
